from aiogram import Router, F
from aiogram.types import Message


router = Router()


@router.message(F.text == "👩 О Полечке")
async def master_handler(message: Message):
    await message.answer(
        "👩 <b>ПОЛЕЧКА</b>\n\n"
        "Поля, приятно познакомиться 🩷\n\n"
        "Я мастер по наращиванию ресниц, "
        "с опытом работы более 6 лет.\n\n"
        "Работаю с классическим и объёмным наращиванием, "
        "используя исключительно качественные материалы. "
        "Каждый клиент для меня — уникален, поэтому "
        "подбираю реснички индивидуально, чтобы подчеркнуть "
        "вашу естественную красоту.\n\n"
        "Особое внимание уделяю здоровью ваших ресничек, "
        "поэтому я всеми руками за <b>КАЧЕСТВЕННОЕ наращивание</b> "
        "без склеек и с правильным отступом! 🩷\n\n"
        "Гарантирую аккуратность, комфорт и долгую носку.\n\n"
        "💡 <b>LED наращивание +200 ₽ к прайсу.</b>\n"
        "Если хотите именно его — сообщите до начала процедуры 🫶🏼\n\n"
            "Скорее записывайся и приходи за красивыми ресничками 💋",
        parse_mode="HTML",
    )